### 누락된 데이터 처리하기

In [1]:
import numpy as np
import pandas as pd

In [2]:
#  NaN 포함한 문자열 시리즈 만들기

string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
# NaN 값 찾기

string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
# 첫번째 값 NaN으로 바꾸기

string_data[0] = None

In [6]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### 누락된 데이터 골라내기

**dropna**메소드를 적용하여 null이 아닌 데이터와 색인값만 들어 있는 Series를 반환할 수 있다.

In [7]:
from numpy import nan as NA

In [8]:
data = pd.Series([1,NA,3.5,NA,7])

In [9]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

위 코드를 다음과 같이 동일하게 표현도 가능하다.

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

DataFrame 객체의 경우 dropna는 기본적으로 NA값을 하나라도 포함하고 있는 로우를 제외시킨다.

In [11]:
data = pd.DataFrame([[1,2,3,4],[1.,NA,NA,NA],[5,3,1,2],[NA,NA,NA,NA]])

In [12]:
cleaned = data.dropna()

In [13]:
cleaned

     0    1    2    3
0  1.0  2.0  3.0  4.0
2  5.0  3.0  1.0  2.0

**how = 'all'** 옵션을 넘기면 모두 NA 값인 로우만 제외시킨다.

In [14]:
data.dropna(how = 'all')

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  NaN  NaN  NaN
2  5.0  3.0  1.0  2.0

컬럼을 제외시키는 방법도 동일하게 동작한다. 옵션으로 axis = 1을 넣어주면 된다.

In [15]:
# data 4번째 컬럼 NA로 채우기

data[4] = NA

data

     0    1    2    3   4
0  1.0  2.0  3.0  4.0 NaN
1  1.0  NaN  NaN  NaN NaN
2  5.0  3.0  1.0  2.0 NaN
3  NaN  NaN  NaN  NaN NaN

In [16]:
data.dropna(axis = 1 ,how = 'all')

     0    1    2    3
0  1.0  2.0  3.0  4.0
1  1.0  NaN  NaN  NaN
2  5.0  3.0  1.0  2.0
3  NaN  NaN  NaN  NaN

DataFrame의 로우를 제외시키는 방법은 시계열 데이터에 주로 사용되는 경향이 있다.

몇 개 이상의 값이 들어 있는 로우만 살펴보고 싶다면 thresh 인자에 원하는 값을 넘기면 된다.

In [17]:
df = pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0  0.570188 -0.231400 -0.489945
1  0.868175 -0.807861  1.477253
2  0.925397 -1.110413  0.401160
3 -0.585226 -1.279577  1.015095
4 -0.611467 -0.333560 -0.495948
5  0.213456 -0.749321  0.553390
6  0.661677 -0.877754 -0.113671

In [18]:
# df의 1번 컬럼 0부터 3번째 row 값 까지 NA

df.iloc[:4,1] = NA
df

          0         1         2
0  0.570188       NaN -0.489945
1  0.868175       NaN  1.477253
2  0.925397       NaN  0.401160
3 -0.585226       NaN  1.015095
4 -0.611467 -0.333560 -0.495948
5  0.213456 -0.749321  0.553390
6  0.661677 -0.877754 -0.113671

In [19]:
# 결측치 포함값 제거

df.dropna()

          0         1         2
4 -0.611467 -0.333560 -0.495948
5  0.213456 -0.749321  0.553390
6  0.661677 -0.877754 -0.113671

In [20]:
df.dropna(thresh = 2)

          0         1         2
0  0.570188       NaN -0.489945
1  0.868175       NaN  1.477253
2  0.925397       NaN  0.401160
3 -0.585226       NaN  1.015095
4 -0.611467 -0.333560 -0.495948
5  0.213456 -0.749321  0.553390
6  0.661677 -0.877754 -0.113671

### 결측치 채우기

누락된 값을 제외시키지않고 데이터 상의 **구멍**을 어떻게든 메워야할 때가 있다.

**fillna**메소드를 사용한다.

In [21]:
# fillna를 통해 0으로 메꿈

df.fillna(0)

          0         1         2
0  0.570188  0.000000 -0.489945
1  0.868175  0.000000  1.477253
2  0.925397  0.000000  0.401160
3 -0.585226  0.000000  1.015095
4 -0.611467 -0.333560 -0.495948
5  0.213456 -0.749321  0.553390
6  0.661677 -0.877754 -0.113671

In [22]:
# fillna에 사전값을 넘겨 각 컬럼마다 다른 값을 채울수도 있다.

df.fillna({1 : 0.5, 2 : 0})

          0         1         2
0  0.570188  0.500000 -0.489945
1  0.868175  0.500000  1.477253
2  0.925397  0.500000  0.401160
3 -0.585226  0.500000  1.015095
4 -0.611467 -0.333560 -0.495948
5  0.213456 -0.749321  0.553390
6  0.661677 -0.877754 -0.113671

In [23]:
df = pd.DataFrame(np.random.randn(6,3))

df

          0         1         2
0 -0.786916  1.484076 -1.686203
1 -0.017834  1.078725 -0.169258
2  0.486569 -0.074156  0.745736
3 -0.103763 -0.190028  0.149942
4 -1.081625 -0.108292 -0.263254
5  0.890025 -1.153761 -0.051878

In [24]:
# 3번째 row부터 NA

df.iloc[2:,1] = NA
df

          0         1         2
0 -0.786916  1.484076 -1.686203
1 -0.017834  1.078725 -0.169258
2  0.486569       NaN  0.745736
3 -0.103763       NaN  0.149942
4 -1.081625       NaN -0.263254
5  0.890025       NaN -0.051878

In [25]:
# 5번째 값부터 NA

df.iloc[4:,2] = NA

df

          0         1         2
0 -0.786916  1.484076 -1.686203
1 -0.017834  1.078725 -0.169258
2  0.486569       NaN  0.745736
3 -0.103763       NaN  0.149942
4 -1.081625       NaN       NaN
5  0.890025       NaN       NaN

In [26]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.786916  1.484076 -1.686203
1 -0.017834  1.078725 -0.169258
2  0.486569  1.078725  0.745736
3 -0.103763  1.078725  0.149942
4 -1.081625  1.078725  0.149942
5  0.890025  1.078725  0.149942

## 데이터 변형

### 중복 제거하기

In [27]:
data = pd.DataFrame({ 'k1' : ['one','two'] * 3 + ['two'],
                    'k2' : [1,1,2,3,3,4,4]})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

**duplicated**메소드는 각 로우가 중복인지 아닌지 알려주는 불리언 Series를 소환한다.

In [28]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [29]:
# drop_duplicates()를 사용
# False인 DataFrame만 반환

data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

### 함수나 매핑을 이용해서 데이터 변형하기

In [30]:
data = pd.DataFrame({'food' : ['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox' ],
                    'ounces' : [4.,3.,12.,6.,7.5,8.,3.,5.,6.]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [31]:
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork' : 'cow',
    'pastrami' : 'cow',
    'corned beef' : 'cow',
    'honey ham' : 'pig', 
    'nova lox' : 'salmon'
}

meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'cow',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [32]:
# 대소문자를 모두 소문자로

lowerdata = data['food'].str.lower()
lowerdata

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [33]:
# map 메소드를 통해 사전 객체를 받음.

data['animal'] = lowerdata.map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     cow
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [34]:
# 함수를 넘겨서 수행
data['food'].map(lambda x : meat_to_animal[x.lower()])

0       pig
1       cow
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 값 치환하기

**fillna** : 누락된 값을 채움

**map** : 한 객체 안에서 값의 부분집합을 변경하는데 사용

**replace** : 같은 작업에 대해 좀 더 간단하고 유연한 방법 제공.

In [35]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.,])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

-999는 누락된 데이터를 나타내기 위한 값

replace를 통해 NA 값으로 치환한 Series를 생성할 수 있다.

In [36]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [37]:
# 여러 개의 값을 치환

data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [38]:
# 치환하려는 값마다 다른 값으로 치환

data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [39]:
# 리스트 대신 사전도 가능함.

data.replace({-999 : np.nan ,-1000 : 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 축 색인 이름 바꾸기

Series처럼 함수나 새롭게 바꿀 값을 이용해서, 새로운 구조 자료를 만들지 않고 그 자리에서 바로 축 이름을 변경하는 것이 가능하다.

In [40]:
data = pd.DataFrame(np.arange(12).reshape(3,4),
                   index = ['Ohio','Colo','New'],
                   columns = ['One','Two','Three','Four'])
data

      One  Two  Three  Four
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [41]:
# Series와 동일하게 map 메소드를 사용할 수 있다.

transform = lambda x : x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW'], dtype='object')

In [42]:
# 대문자로 변경한 축 이름을 DataFrame index에 바로 대입

data.index = data.index.map(transform)

data

      One  Two  Three  Four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [43]:
# rename을 사용해 원래 객체를 변경하지않고 새로운 객체를 생성

data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

rename 메소드는 사전 형식의 객체를 이용해서 축 이름 중 일부만 병경하는 것도 가능하다.

In [44]:
data.rename(index = {'OHIO' : 'INDIANA'},
           columns = {'Three' : 'peekaboo'})

         One  Two  peekaboo  Four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

원본 데이터를 바로 변경하려면 inplace = True 옵션을 사용하면 된다!

In [45]:
data.rename(index = {'OHIO' : 'INDIANA'},inplace = True)

data

         One  Two  Three  Four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### 개별화와 양자화

연속성 데이터는 종종 개별로 분할하거나 아니면 분석을 위해 그룹별로 나누기도 한다.

In [46]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]

pandas의 cut 함수를 이용해서 **18-25, 26-35, 35-60, 60이상** 그룹으로 나누어보자.

In [47]:
bins = [18,25,35,60,100]

In [48]:
cats = pd.cut(ages,bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [49]:
# pandas.cut 결과에 대한 그룹 수

pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [50]:
# right = False를 통해 중괄호 쪽은 포함하지 않고 대괄호 쪽을 포함

cats = pd.cut(ages,[18,26,36,61,100], right =False)

cats

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [51]:
# labels를 통해 그룹의 이름을 직접 넘겨줌

group_names = ['Youth', 'YoungAdult','MiddleAged','Senior']

pd.cut(ages,bins,labels = group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

### 특잇값을 찾고 제외하기

In [52]:
data = pd.DataFrame(np.random.randn(1000,4))

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.019188    -0.000400     0.010319    -0.016148
std       1.021865     1.013621     0.991900     0.961855
min      -3.074467    -3.846497    -3.202889    -3.826610
25%      -0.766578    -0.645419    -0.656597    -0.616622
50%      -0.024247    -0.004747    -0.010728    -0.016726
75%       0.712430     0.675113     0.729272     0.581655
max       3.500365     2.919340     3.427058     3.128634

In [53]:
# 3을 초과하는 값 찾기

col = data[2]
col

0     -1.041389
1      1.516327
2     -0.348424
3      0.812384
4     -1.400112
5     -0.073484
6     -0.373376
7      1.535699
8      0.172469
9      1.269170
10     1.333135
11    -1.016117
12    -0.911119
13     0.801957
14     2.164125
15     1.081116
16     1.370541
17    -0.238060
18    -0.198799
19    -0.287324
20    -0.422345
21    -1.594203
22     0.348285
23    -0.528854
24    -2.176479
25     1.569868
26    -0.054979
27    -0.384082
28    -0.166738
29    -0.264924
         ...
970   -1.058116
971   -0.557236
972   -0.108929
973    0.742739
974    1.658527
975   -0.782279
976   -0.792475
977    0.280860
978   -0.324461
979   -0.235692
980    0.309767
981    0.540387
982    1.105148
983    0.641814
984   -1.326041
985    1.706786
986    0.728912
987    0.859498
988   -1.879953
989   -0.505135
990    0.236511
991   -0.622455
992   -0.321016
993    0.871214
994   -1.756728
995   -1.545039
996    0.460390
997   -1.387779
998   -0.290577
999    0.720793
Name: 2, Length: 1000, dtype: float64

In [54]:
col[np.abs(col) > 3]

413   -3.062626
514   -3.202889
589    3.427058
Name: 2, dtype: float64

절대값이 3을 초과하는 값이 들어있는 모든 로우를 선택하려면 any메소드를 사용한다.

In [55]:
data[(np.abs(data)> 3).any(1)]

            0         1         2         3
60  -0.389147  0.397453 -0.320485 -3.826610
124 -0.281804 -3.586749 -0.282800 -0.858587
327  0.996025 -3.344860 -1.441311 -0.294074
413  0.081174 -1.555899 -3.062626 -1.137951
478  3.500365  0.324777  0.526255 -0.618810
514 -0.387904  1.262420 -3.202889 -1.855049
533 -0.959795 -3.846497  1.769194  0.060808
561 -0.006825  0.105128 -2.105002  3.060850
568 -3.074467 -0.874079 -0.122154  2.796136
589  0.355751 -1.208171  3.427058  3.128634
627 -0.114422 -3.282406  2.132653  1.637406
775 -0.894657 -3.008442 -1.338579 -1.520142
919  3.341523 -1.527373 -1.854836 -0.014681
929 -0.377496 -3.153405  0.281398 -0.778252
987 -0.126627 -0.470271  0.859498  3.042818

In [56]:
# -3이나 3을 초과하는 값을 -3 이나 3으로 지정

data[np.abs(data) > 3] = np.sign(data) * 3

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.019955     0.001822     0.010158    -0.015554
std       1.018970     1.006376     0.989688     0.958185
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.766578    -0.645419    -0.656597    -0.616622
50%      -0.024247    -0.004747    -0.010728    -0.016726
75%       0.712430     0.675113     0.729272     0.581655
max       3.000000     2.919340     3.000000     3.000000

**np.sign(data)**는 data 값이 양수인지 음수인지에 따라 -1이나 1이 담긴 배열을 반환한다.

In [57]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0  1.0
1 -1.0 -1.0  1.0  1.0
2 -1.0  1.0 -1.0  1.0
3  1.0  1.0  1.0 -1.0
4 -1.0  1.0 -1.0 -1.0

### 치환과 임의 샘플링

In [59]:
df = pd.DataFrame(np.arange(5 * 4).reshape(5,4))

df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [60]:
# 순서를 바꾸고 싶은 만큼의 길이를 permutation 함수로 넘기면 바뀐 순서가 담긴 정수 배열이 생성
sampler = np.random.permutation(5)

sampler

array([2, 3, 4, 0, 1])

In [62]:
# 배열 사용

df.take(sampler)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
0   0   1   2   3
1   4   5   6   7

In [64]:
# 치환 없이 일부만 임의로 선택

df.sample(n = 3)

    0   1   2   3
3  12  13  14  15
2   8   9  10  11
4  16  17  18  19